app/Controllers/Barang.php

    public function index()
    {
        $data['barang'] = $this->barangModel->findAll();
---
SELECT *
FROM `barang`

    public function TambahBarang()
    {
        $data['barang'] = $this->barangModel->findAll();
---
SELECT *
FROM `barang`

    public function GetBarangByID($id_barang)
    {
        $barang = $this->barangModel->find($id_barang);
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '17'

            'stok' => $stok,
        ];

        $this->barangModel->update($id_barang, $dataBarang);
---
UPDATE `barang` SET `tanggal` = '2024-06-11', `jenis_barang` = 'obat', `nama_barang` = 'Bodrexnnn', `harga` = '10.000', `stok` = '63'
WHERE `barang`.`id_barang` IN ('17')