app/Controllers/Pengguna.php

    public function index()
    {
        $penggunaModel = new M_Pengguna();
        $data['pengguna'] = $penggunaModel->findAll();
---
SELECT *
FROM `pengguna`