app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
---
    public function index()
    {
        $data['transaksi'] = $this->transaksiModel->findAll();

SELECT *
FROM `barang`
---
    public function TambahTransaksi()
    {
        $data['barang'] = $this->barangModel->findAll();

SELECT *
FROM `transaksi`
WHERE `transaksi`.`id_transaksi` = '73'
SELECT *
FROM `detail_transaksi`
WHERE `id_transaksi` = '73'
SELECT *
FROM `barang`
---
    public function GetTransaksiByID($id_transaksi)
    {
        $transaksi = $this->transaksiModel->find($id_transaksi);
        $detailTransaksi = $this->detailTransaksiModel->where('id_transaksi', $id_transaksi)->findAll();
        $barang = $this->barangModel->findAll();

SELECT *
FROM `transaksi`
WHERE `transaksi`.`id_transaksi` = '70'
SELECT *
FROM `detail_transaksi`
WHERE `id_transaksi` = '70'
---
    public function UbahTransaksi()
    {
        $id_transaksi = $this->request->getPost('id_transaksi');
        $jenis_transaksi_baru = $this->request->getPost('jenis_transaksi');
        $tanggal_transaksi = $this->request->getPost('tanggal_transaksi');
        $id_barang = $this->request->getPost('id_barang');
        $jumlah_barang = $this->request->getPost('jumlah_barang');
        $harga_total = $this->request->getPost('harga_total');

        // Hitung total harga dan jumlah barang
        $total_harga = 0;
        foreach ($harga_total as $harga) {
            $total_harga += floatval(str_replace('.', '', $harga));
        }
        // Total harga tetap disimpan sebagai string dengan titik
        $total_harga_string = number_format($total_harga, 0, '', '.');

        // Kalkulasi total jumlah barang
        $total_jumlah_barang = array_sum($jumlah_barang);

        // Data transaksi untuk update
        $dataTransaksi = [
            'tanggal_transaksi' => $tanggal_transaksi,
            'jenis_transaksi' => $jenis_transaksi_baru,
            'jumlah_barang' => $total_jumlah_barang,
            'harga_total' => $total_harga_string // Simpan total harga dengan titik
        ];

        $transaksi_lama = $this->transaksiModel->find($id_transaksi);
        $detailTransaksiLama = $this->detailTransaksiModel->where('id_transaksi', $id_transaksi)->findAll();

UPDATE `transaksi` SET `tanggal_transaksi` = '2024-07-01', `jenis_transaksi` = 'barang_masuk', `jumlah_barang` = 30, `harga_total` = '300.000'
WHERE `transaksi`.`id_transaksi` IN ('70')
DELETE FROM `detail_transaksi`
WHERE `id_transaksi` = '70'
---
            }
        }

        $this->transaksiModel->update($id_transaksi, $dataTransaksi);
        $this->detailTransaksiModel->where('id_transaksi', $id_transaksi)->delete();

INSERT INTO `detail_transaksi` (`id_transaksi`, `id_barang`, `jumlah_barang`, `harga_total`) VALUES ('70', '17', '30', '300.000')
---
                'jumlah_barang' => $jumlah_barang[$key],
                'harga_total' => $harga_total[$key] // Simpan harga total sebagai string dengan titik
            ];
            $this->detailTransaksiModel->insert($dataDetail);