app/Models/M_Barang.php

    public function updateStock($id_barang, $jumlah, $jenis_transaksi, $isReverting = false)
{
    $barang = $this->find($id_barang);
    if ($jenis_transaksi == 'barang_masuk') {
        $new_stok = $isReverting ? $barang['stok'] - $jumlah : $barang['stok'] + $jumlah;
    } else {
        $new_stok = $isReverting ? $barang['stok'] + $jumlah : $barang['stok'] - $jumlah;
    }
    if ($new_stok < 0) {
        $new_stok = 0;
    }
    $this->update($id_barang, ['stok' => $new_stok]);
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '17'
UPDATE `barang` SET `stok` = 60
WHERE `barang`.`id_barang` IN ('17')